Enums/упТипыДействийСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыДействийСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗаданияНаПеревозкуГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗадачиИсполнителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗадачиНаОтправкуФайлов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗапросаУсловийПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьЗаявкиНаПеревозкуГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПодтвержденияЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПредложенияПеревозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПрохождениеТочки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьПутевогоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьОперацийСКонтейнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьСобытияМониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписьФактическихРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеМаршрутаПоРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРаботПоРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗаданияНаПеревозку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗапросаУсловийПеревозки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗаявкиНаПеревозку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаЗаявкиНаТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаПутевогоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаРейса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСтатусаОперацийСКонтейнером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеЭкипажаПоРейсу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрисоединениеФайла</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упТипыДействийСобытий/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокИсключений = Новый СписокЗначений;
	Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетПутевыхЛистов") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьПутевогоЛиста);
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ИзменениеСтатусаПутевогоЛиста);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаСпутниковыйМониторинг") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьСобытияМониторинга);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуютсяУсловияПеревозок") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьЗапросаУсловийПеревозки);
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ИзменениеСтатусаЗапросаУсловийПеревозки);
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("упИспользуетсяАндроидКлиент") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьЗадачиНаОтправкуФайлов);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьЗадачиИсполнителя);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуютсяКонтейнерныеПеревозки") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьОперацийСКонтейнером);
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ИзменениеСтатусаОперацийСКонтейнером);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упТипыДействийСобытий.Ссылка
	|ИЗ
	|	Перечисление.упТипыДействийСобытий КАК упТипыДействийСобытий
	|ГДЕ
	|	НЕ упТипыДействийСобытий.Ссылка В (&СписокИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	упТипыДействийСобытий.Порядок";
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
